Autodesk.Revit.DB.Arc.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new geometric arc object based on three points.
end0:
The start point of the arc.
end1:
The end point of the arc.
pointOnArc:
A point on the arc.
Returns:
The new arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors end0 and end1 are coincident.
-or-
The vectors end0 and pointOnArc are coincident.
-or-
The vectors end1 and pointOnArc are coincident.
-or-
Cannot create an arc.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.DB.Arc.Create(Autodesk.Revit.DB.Plane,System.Double,System.Double,System.Double)
Creates a new geometric arc object based on plane, radius, and angles.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded circle.
plane:
The plane which the arc resides. The plane's origin is the center of the arc.
radius:
The radius of the arc.
startAngle:
The start angle of the arc (in radians).
endAngle:
The end angle of the arc (in radians).
Returns:
The new arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for radius must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Start angle must be less than end angle.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.DB.Arc.Create(Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new geometric arc object based on center, radius, unit vectors, and angles.
Remarks:
If the angle range is equal to or greater than 2 * PI, the curve will be
automatically converted to an unbounded circle.
center:
The center of the arc.
radius:
The radius of the arc.
startAngle:
The start angle of the arc (in radians).
endAngle:
The end angle of the arc (in radians).
xAxis:
The x axis to define the arc plane. Must be normalized.
yAxis:
The y axis to define the arc plane. Must be normalized.
Returns:
The new arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xAxis is not length 1.0.
-or-
yAxis is not length 1.0.
-or-
The given value for radius must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The vectors xAxis and yAxis are not perpendicular.
-or-
Start angle must be less than end angle.
-or-
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.DB.Arc.Radius
Returns the radius of the arc.

Autodesk.Revit.DB.Arc.YDirection
Returns the Y direction.

Autodesk.Revit.DB.Arc.XDirection
Returns the X direction.

Autodesk.Revit.DB.Arc.Normal
Returns the normal to the plane in which the arc is defined.

Autodesk.Revit.DB.Arc.Center
Returns the center of the arc.

Autodesk.Revit.DB.Arc
A circular arc.
Remarks: The arc lies in the plane defined by center and normal.